{"sessionDescription": "The 1915 Panama-Pacific International Exposition and the Golden Age of the American Pipe Organ \r\n\r\nFrom February to December 1915, San Francisco welcomed 18 million visitors to the highly successful Panama-Pacific International Exposition (PPIE). Situated on 600 acres of waterfront in what is today’s marina district, this impressive world’s fair commemorating the completion of the Panama Canal offered visitors a myriad of exhibits relating to industry, technology, and the arts. One of the exhibits was a new organ built by the Austin Organ Company the exposition’s Festival Hall. The organ was used for daily concerts by the day’s leading organists, including the British virtuoso Edwin H. Lemare, who played 100 concerts over the course of six weeks. \r\n\r\nIn this period of history, the pipe organ stood at the intersection of industry, technology, culture, and commerce, and it epitomized the spirit of progress that was so intrinsic to U.S. world’s fairs. Organ series were an important feature of the music programs at the expositions in Chicago, Buffalo, and St. Louis, and San Francisco’s event followed those models. These events introduced the organ to a general audience and paved the way for a golden age of civic organ building and culture in this country. \r\n\r\nDrawing on archival research in UCLA Berkeley’s Bancroft Library and publications by Austin Opus 500 expert Justin Kielty, this presentation will share the fascinating story of the PPIE organ series while placing it in the larger context of world’s fair scholarship and the history of the pipe organ in the U.S.", "sessionEndDateTime": "2024-06-30T13:00:00", "sessionName": "Organ Concerts at San Francisco’s World’s Fair", "sessionStartDateTime": "2024-06-30T12:00:00", "sessionStub": "8D189028-7DAD-4AD0-8A6B-50C0FC3D0A6D", "speakerCategory": ["Organist"], "speakers": ["DF5790FB-1F67-4F18-B30A-CFA3337CD1E8"], "timezoneName": "Pacific Time", "updatedDate": "2023-09-04"}