{"presenterAt": [], "speakerBiography": "David Vogels, CAGO, writes the monthly Commentary for The American Organist magazine. His groundbreaking report on “The Birth of Messiaen’s Livre du Saint Sacrement” appeared in the January issue of that publication. He has recently translated the most comprehensive survey of Messiaen’s organ cycle, Olivier Messiaen’s Livre du Saint Sacrement: Mystery of the Eucharistic Presence by Dorothee Bauer, from the original German for publication by Brill | Schöningh (available from the publisher or Amazon).\r\nMr. Vogels served six years each as the American Guild of Organists’ National Councillor for Competitions and New Music and National Councillor for Professional Concerns. He has directed the Guild’s Long-Range Planning Task Force, Committee on National Conventions, Task Force on the Convention Cycle, and Region VI Nominating Committee. He has also served as Coordinator of the 1998 National Convention in Denver, Region VI Professional Concerns Coordinator, and Dean of the Denver Rocky Mountain Chapter, as well as a member of the AGO’s Public Relations Task Force and its Marketing, Budget, Nominating, and New Music committees. \r\nMr. Vogels has been organist at several Denver-area churches, including St. John’s Episcopal Church in Boulder and Wheat Ridge United Methodist Church, and currently works on a freelance basis. He has performed recitals in Colorado and Texas, with a particular emphasis on new music, and has commissioned works for organ by William Albright, Naji Hakim, Dan Locklair, Stephen Paulus, and C. Curtis-Smith.\r\nMr. Vogels is President and Executive Editor of the Journal of Clinical Orthodontics and was the founding Editor of Sommelier Journal. He holds a bachelor’s degree in journalism from the University of Missouri and a master’s in music literature from the University of Colorado. His other interests include popular music, wine, golf, and skiing.", "speakerDisplayName": "David Vogels", "speakerFirstName": "David", "speakerLastName": "Vogels", "speakerStub": "39776A8E-7C50-4B9F-9962-44D0F379A48C", "speakerTitle": "", "updatedDate": "2023-09-19"}