{"presenterAt": [], "speakerBiography": "Maria Forsström is a singer and conductor, being equally at ease in the symphonic repertoire, at a Lieder recital or in front of a choir. First having studied church music, piano and conducting in Stockholm, London, and St. Petersburg, she wanted to be the instrument herself, starting singing at the age of 33. She is much appreciated for her intelligent musicianship and enjoyment of exploring different musical styles. The years 2014-2023 she was the head vocal coach of the Gothenburg Symphony Chorus. \r\n\r\nMaria Forsström has performed, toured, and recorded with among others Teodor Currentzis and MusicaAeterna, Mahler Chamber Orchestra, Orchestra dell'Accademia Nazionale di Santa Cecilia, Perm Opera House, Michailovsky Opera, St. Petersburg, Novaya Opera, Moscow, Helsinki Opera House, Nagoya Philharmonic Orchestra, Warsaw Philharmonic Orchestra, the Polish Radio Symphony Orchestra NOSPR, Südwest-deutsches Philharmonie, RE:Baroque Stockholm, Swedish Chamber Orchestra, Gothenburg Symphony Orchestra and The State Symphony Orchestra of Ukraine. \r\n\r\n2019 Maria Forsström won 1.prize at the longstanding Varadin Baroque Festival, Croatia. She has recorded for Sony Classical, Chandos Records and BIS. 2021 she appeared on BIS Records with the Monteverdi ”L’Orfeo” as La Messaggera, with great reviews. In October 2021 Maria joined The Oxford Lieder Festival for the 6th time since 2014 and currently sings the Schubert Winterreise with the acclaimed pianist Bengt Forsberg. \r\n\r\nDuring 2023-24 Maria sings chamber music, commissioning new music for her trio of vibraphone/organ and voice, collaborating with the Nobel Prize winner 2020 Louise Glück. She is also singing oratory and symphonic repertoire such as Mahler’s “Das Lied von der Erde” in Sweden, doing choral workshops in London and Bangalore, later in Spring returning to the French Radio Choir in Paris as a choir master. With her own choir in Sweden, she’s doing the Alfred Schnittke “Concert for Choir”.", "speakerDisplayName": "Maria Forsström", "speakerFirstName": "Maria", "speakerLastName": "Forsström", "speakerStub": "84AD2B4B-D4D2-424F-ABDF-342B0E7C8210", "speakerTitle": "", "updatedDate": "2023-09-19"}