{"presenterAt": ["CF79AA12-6437-4613-A4B2-D804FC0708CB"], "speakerBiography": "Kimberly Marshall is known worldwide for her compelling programs and presentations of organ music. She currently holds the Patricia and Leonard Goldman Endowed Professorship in Organ at Arizona State University; from 2020-22, she held the Hedda Andersson Visiting Professorship at the Malmö Academy of Music. In 2022, she was awarded the Medal of the Royal College of Organists, their highest honor, in recognition of her distinguished achievement in organ performance and scholarship.\r\n\r\nKimberly has performed and presented her research at 13 national conventions of the AGO, and she is honored to present the final concert for the San Francisco Convention. She is known for her creative programming, her eclectic repertoire and her scholarship. Her recording Celebrating Notre-Dame, released in 2021, includes music spanning five centuries, played on the world’s largest meantone organ in Göteborg, Sweden. Engagements in 2023-4 include recitals for the Oaxaca International Organ Festival, teaching residencies at Yale University and the Tokyo University of the Arts, and performances at the Orgelpark in Amsterdam, St. Paul’s Cathedral, London, and on the new symphonic organ at Göteborg Concert Hall.\r\n\r\nIn addition to her research into historical performance practice, she has investigated the use of sound vibrations in a restorative practice and developed organ sound meditations which she has presented at many venues in the US and Europe. A current focus of Kimberly’s scholarship is the creation of an online Encyclopedia of the Organ, which she hopes to launch in 2025.\r\n\r\nSee http://www.kimberlymarshall.com/ or visit https://www.facebook.com/KimberlyMarshall.organist.", "speakerDisplayName": "Kimberly Marshall", "speakerFirstName": "Kimberly", "speakerLastName": "Marshall", "speakerStub": "B4005F63-3275-4C21-A476-FB5DE091209D", "speakerTitle": "", "updatedDate": "2023-09-04"}